blog/2021/sass-basics.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 19:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Sass Basics</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Sass Basics</h1>
</header><p>
<a href="https://sass-lang.com/guide">https://sass-lang.com/guide</a>
</p>

<div id="outline-container-orge76d3d2" class="outline-2">
<h2 id="orge76d3d2">Preprocessing</h2>
<div class="outline-text-2" id="text-orge76d3d2">
<p>
Sass 这一预处理工具，能够帮助我写作更具健壮性、可维护的 CSS。
</p>

<p>
可通过 <code>yarn global add sass</code> 全局安装。之后可以在 Terminal 执行：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #706565;"># </span><span style="color: #857575;">compile one file</span>
sass input.scss output.css
<span style="color: #706565;"># </span><span style="color: #857575;">watch individual files or directories</span>
sass --watch input.scss output.css
<span style="color: #706565;"># </span><span style="color: #857575;">watch input folder and ouput folder</span>
sass --watch app/sass:public/stylesheets
</pre>
</div>
</div>
</div>

<div id="outline-container-org1842b6c" class="outline-2">
<h2 id="org1842b6c">Variables</h2>
<div class="outline-text-2" id="text-org1842b6c">
<p>
变量（Variables）可以存储需要重复使用的信息。
</p>

<div class="org-src-container">
<pre class="src src-scss"><span style="color: #aaca86;">$font-stack</span>: Helvetica, sans-serif;
<span style="color: #aaca86;">$primary-color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;

<span style="color: #a9df90;">body </span>{
  <span style="color: #91a0b3;">font</span>: 100% <span style="color: #aaca86;">$font-stack</span>;
  <span style="color: #91a0b3;">color</span>: <span style="color: #aaca86;">$primary-color</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #a9df90;">body </span>{
  <span style="color: #91a0b3;">font</span>: 100% Helvetica, sans-serif;
  <span style="color: #91a0b3;">color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9925f20" class="outline-2">
<h2 id="org9925f20">Nesting</h2>
<div class="outline-text-2" id="text-org9925f20">
<p>
Sass 能够处理和 HTML 一样，写出嵌套的 CSS。但注意不要滥用。
</p>

<div class="org-src-container">
<pre class="src src-scss"><span style="color: #a9df90;">nav </span>{
  <span style="color: #a9df90;">ul </span>{
    <span style="color: #91a0b3;">margin</span>: 0;
    <span style="color: #91a0b3;">padding</span>: 0;
    <span style="color: #91a0b3;">list-style</span>: none;
  }

  <span style="color: #a9df90;">li </span>{ <span style="color: #91a0b3;">display</span>: inline-block; }

  <span style="color: #a9df90;">a </span>{
    <span style="color: #91a0b3;">display</span>: block;
    <span style="color: #91a0b3;">padding</span>: 6px 12px;
    <span style="color: #91a0b3;">text-decoration</span>: none;
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #a9df90;">nav ul </span>{
  <span style="color: #91a0b3;">margin</span>: 0;
  <span style="color: #91a0b3;">padding</span>: 0;
  <span style="color: #91a0b3;">list-style</span>: none;
}
<span style="color: #a9df90;">nav li </span>{
  <span style="color: #91a0b3;">display</span>: inline-block;
}
<span style="color: #a9df90;">nav a </span>{
  <span style="color: #91a0b3;">display</span>: block;
  <span style="color: #91a0b3;">padding</span>: 6px 12px;
  <span style="color: #91a0b3;">text-decoration</span>: none;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge402b04" class="outline-2">
<h2 id="orge402b04">Partials</h2>
<div class="outline-text-2" id="text-orge402b04">
<p>
还可以创建一些小的代码片段，包含在一个主 Sass 文件中。代码片段可视为模块化的组件。代码片段文件的命名： <code>_filename.scss</code> ，有了 <code>_</code> 在编译时 不会生成 *.css 文件。在主 Sass 文件中，使用 <code>@use</code> 调用 partial 文件。
</p>
</div>
</div>

<div id="outline-container-org8f32874" class="outline-2">
<h2 id="org8f32874">Modules</h2>
<div class="outline-text-2" id="text-org8f32874">
<p>
目前只有 Dart Sass 支持使用 <code>@use</code> 导入模块，其他分支（LibSass，Ruby Sass）需使用 <code>@import rule</code> ，后者已经<a href="https://sass-lang.com/documentation/at-rules/import">不鼓励使用</a>。
</p>

<div class="org-src-container">
<pre class="src src-scss"><span style="color: #706565;">// </span><span style="color: #857575;">_base.scss</span>
<span style="color: #aaca86;">$font-stack</span>: Helvetica, sans-serif;
<span style="color: #aaca86;">$primary-color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;

<span style="color: #a9df90;">body </span>{
  <span style="color: #91a0b3;">font</span>: 100% <span style="color: #aaca86;">$font-stack</span>;
  <span style="color: #91a0b3;">color</span>: <span style="color: #aaca86;">$primary-color</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scss"><span style="color: #706565;">// </span><span style="color: #857575;">styles.scss</span>
<span style="color: #9fbfdf;">@use</span> <span style="color: #ddbc91;">'base'</span>;

<span style="color: #a9df90;">.inverse </span>{
  <span style="color: #91a0b3;">background-color</span>: base.<span style="color: #aaca86;">$primary-color</span>;
  <span style="color: #91a0b3;">color</span>: <span style="color: #000000; background-color: #ffffff;">white</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #a9df90;">body </span>{
  <span style="color: #91a0b3;">font</span>: 100% Helvetica, sans-serif;
  <span style="color: #91a0b3;">color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;
}

<span style="color: #a9df90;">.inverse </span>{
  <span style="color: #91a0b3;">background-color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;
  <span style="color: #91a0b3;">color</span>: <span style="color: #000000; background-color: #ffffff;">white</span>;
}
</pre>
</div>



<p>
Mixins
Extend/Inheritance
Operators
</p>
</div>
</div>
</div>
</body>
</html>